Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: འོན་ཏེ་མི་དགེ་བ་ལ་སྤྱོད་ན་དེ་ལ་སྐྱོ་བ་མང་བ་དང་། རྟོག་པ་མང་བ་ཡིན་ཏེ། མི་དགེ་བའི་ཆོས་དེ་དག་སྤང་བ་ལ་བརྩོན་པ་ཡིན་ནོ།
en: “If, however, they find that their mind is involved in something unvirtuous, they will feel great weariness, ponder it extensively, and then strive to abandon those unvirtuous qualities.

source: མི་དགེ་བའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: Which, then, are unvirtuous qualities?

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གོ།
en: Desire, anger, and dullness.

source: དེ་ལ་འདོད་ཆགས་རྣམ་པ་གསུམ་དུ་རིག་པར་བྱ་སྟེ། ཆེན་པོ་དང་། འབྲིང་པོ་དང་། ཆུང་ངུའོ།
en: Desire is threefold, as there is greater, middling, and lesser desire.

source: དེ་ལ་འདོད་ཆགས་ཆེན་པོ་གང་ཞེ་ན། གང་ལུས་ཐམས་ཅད་དུ་ཁྱབ་སྟེ། སེམས་ཀུན་ནས་བཟུང་ཞིང་གནས་པ་དང་།
en: As for greater desire, this is when the emotion permeates the entire body and captures the mind completely.

source: གང་གིས་དེ་ལ་གཞོལ་ཞིང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་མི་འཐོབ་པ་སྟེ།
en: In this way one applies oneself entirely to desire without there being any occasion without it.

source: དེ་ལ་གཞོལ་བ་དེ་ལ་ངོ་ཚ་བ་དང་། འཛེམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་ཏེ།
en: Having given in to desire, one feels no shame or shyness at all.

source: ཇི་ལྟར་ན་ངོ་ཚ་བ་དང་། འཛེམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པ་ཡིན་ཞེ་ན།
en: Such complete absence of shame and shyness expresses itself in the following ways:

source: དེ་གཅིག་པུ་ལྐོག་ཏུ་སོང་སྟེ། དེ་ཉིད་རྗེས་སུ་རྣམ་པར་སེམས། དེ་ཉིད་རྗེས་སུ་རྣམ་པར་རྟོག་ཅིང་།
en: First, shamelessness is when, while one remains alone and in private, one’s mind remains desirous, giving rise to thoughts of desire.

source: དེ་ཉིད་ལ་ལེགས་པར་ཤིན་ཏུ་སྨོན་པ་དང་། དེ་ཉིད་ལ་ཡང་ཡོན་ཏན་དུ་ལྟ་བ་ཡིན་ཏེ།
en: Thus one holds desirous situations to be excellent and the emotion to be a good quality.

source: ཇི་ལྟར་ན་འཛེམ་པ་མེད་པ་ཡིན་ཞེ་ན། དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ཕ་མའམ། བླ་མ་ལྟ་བུ་གཞན་དག་དང་། རྩོད་ཅིང་ཕྱིར་བཟློགས་པ་དང་། རྒོལ་བར་བྱེད་ཅིང་དེས་ངོ་མི་ཚ་ལ་དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བ་ཡིན་ཏེ
en: Absence of shyness, on the other hand, is when the causes, conditions, and bases for desire make it so that even if one’s parents, spiritual teacher, or the like object to, oppose, or criticize this, one feels no shame about one’s desire, and instead, shamelessly, one holds the emotion to be a valuable quality.

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ངན་སོང་རྣམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Thus, by such causes, conditions, and bases one will come to take birth in the lower realms.

source: དེ་ནི་འདོད་ཆགས་ཆེན་པོ་ཞེས་བྱའོ།
en: This is what is known as greater desire

source: དེ་ལ་འདོད་ཆགས་འབྲིང་པོ་གང་ཞེ་ན།
en: “As for middling desire,

source: གང་གིས་འདོད་པ་རྣམས་ལ་སྟེན་པར་གྱུར་ན་བྱ་བ་གྲུབ་ཀྱི་བར་དུ་སྟེན་གྱི།
en: this is when someone adheres to desire and then, based on that, follows a course of action through to completion.

source: བྱ་བ་གྲུབ་ནས་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་འཐོབ་པ་དང་། འགྱོད་པ་འཐོབ་པ་དང་། སེམས་ལ་མི་ཆབ་འཐོབ་པ་སྟེ།
en: once the activity has been completed, one becomes free of desire, full of regret, and feels that it was inappropriate.

source: དེ་ནི་འདོད་ཆགས་འབྲིང་པོ་ཞེས་བྱའོ།
en: This is what is known as middling desire

source: དེ་ལ་འདོད་ཆགས་ཆུང་ངུ་གང་ཞེ་ན། གང་གིས་འདོད་པ་རྣམས་ལ་སྟེན་པར་གྱུར་ཀྱང་མནམས་པ་དང་། བྱུགས་པ་དང་། ལུས་ཀྱིས་རེག་པ་ཙམ་འམ། ཚིག་ཏུ་སྨྲ་བ་ཙམ་འམ། མཐོང་བ་ཙམགྱི་ས་ཚིམ་པར་འགྱུར་བ་
en: Lesser desire is when one adheres to desire, yet one is satisfied merely by contact through smelling, rubbing, or other bodily contact, or merely by talking, or seeing.

source: དེ་ནི་འདོད་ཆགས་ཆུང་ངུ་ཞེས་བྱའོ།
en: This is known as lesser desire

source: མདོར་ན་འཚོ་བའི་ཡོ་བྱད་ཐམས་ཅད་ལ་ཆགས་པའི་སེམས་སུ་གྱུར་པ་སྟེ་དེ་ནི་འདོད་ཆགས་ཞེས་བྱའོ།
en: In short, desire occurs whenever there is craving for any of the requisites of life.

source: དེ་ལ་ཞེ་སྡང་གང་ཞེ་ན། ཞེ་སྡང་ཡང་རྣམ་པ་གསུམ་དུ་རིག་པར་བྱ་སྟེ། ཆེན་པོ་དང་འབྲིང་པོ་དང་ཆུང་ངུའོ།
en: “What then is anger? Anger is also threefold, as there is greater, middling, and lesser anger.

source: དེ་ལ་ཞེ་སྡང་ཆེན་པོ་གང་ཞེ་ན། ཞེ་སྡང་གི་རྣམ་པ་གང་གིས་ཞེ་སྡང་ཞིང་རྔམ་འཁྲུགས་གཏུམ་པར་གྱུར་ནས་
en: As for greater anger, this is when the expression of furious anger leads to

source: མཚམས་མེད་པ་ལྔ་ལས་གང་ཡང་རུང་བ་ལ་ལ་བྱེད་པའམ། དམ་པའི་ཆོས་སྤོང་བ་གང་བྱས་པ་ལ།
en: the enacting of any one of the five deeds with immediate consequences, or an act of relinquishing the Dharma.

source: མཚམས་མེད་པ་ལྔ་བསྡོམས་པས་ཀྱང་གྲངས་སུ་ཡང་ཉེ་བར་མི་འགྲོ།
en: The latter act is much worse than committing all the five deeds with immediate consequences;

source: ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོ་བ་དེ་ལྟ་བུ་བྱེད་དེ།
en: they cannot compare in terms of any fraction, number, analogy, or likeness.

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ལུས་ཞིག་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དག་ཏུ་སྐྱེ་ཞིང་།
en: With such causes, conditions, and bases one is, upon the destruction of the body, born as a sentient being in a great hell.

source: གལ་ཏེ་བརྒྱ་ལམ་ན་མིར་སྐྱེ་ན་ཡང་གནག་ཅིང་མིག་དམར་ལ་གཏུམ་ཞིང་གནོད་སེམས་མང་བར་འགྱུར་ཏེ།
en: If by some rare chance one should be born as a human it will be as someone uncouth, with red eyes, ferocious, and malicious.

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ཡང་སེམས་ཅན་དམྱལ་བ་དག་དུ་སྐྱེ་བར་འགྱུར་བ་
en: In turn, with such causes, conditions, and bases, such a person will also be born as a sentient being in hell.

source: དེ་ནི་ཞེ་སྡང་ཆེན་པོ་ཞེས་བྱའོ།
en: This is what is known as greater anger

source: དེ་ལ་ཞེ་སྡང་འབྲིང་པོ་གང་ཞེ་ན། གང་གིས་ཞེ་སྡང་བར་གྱུར་ཏེ། སྡིག་པ་མི་དགེ་བའི་ལས་བྱས་ན་མྱུར་བ་མྱུར་བ། སྐྱེན་པ་སྐྱེན་པ། ལ་གོར་ལ་གོར་དུ་འགྱོད་ཅིང་དེའི་གཉེན་པོ་ལ་ཡང་སྟེན་པ་སྟེ།
en: “In the case of middling anger, one will angrily engage in negative, unvirtuous acts, yet quickly, swiftly, and rapidly such acts will be followed by remorse and the application of a remedy.

source: དེ་ནི་ཞེ་སྡང་འབྲིང་པོ་ཞེས་བྱའོ།
en: This is what is referred to as middling anger

source: དེ་ལ་ཞེ་སྡང་ཆུང་ངུ་གང་ཞེ་ན། གང་གིས་ཞེ་སྡང་བར་གྱུར་ནས་ཚིག་ཙམ་དང་། མི་སྙན་པ་ཙམ་དང་། ངན་དུ་བརྗོད་པ་ཙམ་གྱིས་མི་དགེ་བ་ལ་སྩོགས་པ་སྟེ།
en: Lesser anger is when one’s anger causes one to accumulate negative acts through mere words and unpleasant or harsh expressions.

source: དེ་ཡང་དེ་ལ་བརྒྱལ་བར་འགའ་འབྱུང་སྟེ། བྱུང་ན་ཡང་དེའི་སྐད་ཅིག་དེའི་ཡུད་ཙམ་དེའི་ཐང་ཅིག་ལ་གཉེན་པོ་ལ་སྟེན་པ་སྟེ།
en: Although one becomes a little agitated, one immediately relies on a remedy in that very moment.

source: དེ་ནི་ཞེ་སྡང་ཆུང་ངུ་ཞེས་བྱའོ།
en: This is lesser anger

source: དེ་ལ་གཏི་མུག་གང་ཞེ་ན། གཏི་མུག་ཀྱང་རྣམ་པ་གསུམ་དུ་རིག་པར་བྱ་སྟེ། ཆེན་པོ་དང་། འབྲིང་པོ་དང་། ཆུང་ངུའོ།
en: “What then is dullness? Dullness is also threefold, as there is greater, middling, and lesser dullness.

source: གང་དེ་ལ་གཏི་མུག་ཆེན་པོ་གང་ཞེ་ན། གང་ཇི་སྐད་དུ་སྨོས་པའི་གནས་དེ་དག་ལ་ཉེས་ཀྱང་དགའ་ཞིང་མྱ་ངན་དུ་མི་བྱེད།
en: Greater dullness is when flaws of the aforementioned type occur but are accompanied by happiness and are without any sense of pain,

source: སྨྲེ་སྔགས་མི་འདོན། འགྱོད་པ་མེད་པ་ཡིན་ཏེ།
en: without any lamentation, and without regret.

source: དེ་ནི་གཏི་མུག་ཆེན་པོ་ཞེས་བྱའོ།
en: This is what is known as greater dullness

source: དེ་ལ་གཏི་མུག་འབྲིང་པོ་གང་ཞེ་ན། གང་གིས་མི་དགེ་བའི་ལས་ལ་ལ་བྱས་ཀྱང་། ལ་གོར་ལ་གོར་དུ་འགྱོད་ཅིང་།
en: Middling dullness is when one engages in negative acts but with rapid subsequent remorse.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ཀྱི་དྲུང་དུ་འཆགས་ཤིང་མི་འཆབ་ལ།
en: Thus, misdeeds will not be concealed but confessed before those who maintain pure conduct and,

source: དེ་ལ་ཡོན་ཏན་དུ་ཡང་མི་ལྟ་བ་ཡིན་ཏེ།
en: moreover, such deeds will not be considered good qualities.

source: འདི་ནི་གཏི་མུག་འབྲིང་པོ་ཞེས་བྱའོ།
en: This is known as middling dullness

source: དེ་ལ་གཏི་མུག་ཆུང་ངུ་གང་ཞེ་ན། གང་གིས་རང་བཞིན་གྱིས་ཁ་ན་མ་ཐོ་བ་མ་ཡིན་པ།
en: Lesser dullness does not involve natural misdeeds,

source: བཅས་པའི་ཁ་ན་མ་ཐོ་བ་བསླབ་པ་ཀུན་སྤྱད་པའི་ལམ་གཉིས་གསུམ་ལས་འདའ་བ་སྟེ།
en: but rather a prohibited misdeed that ensues from transgressing two or three deeds of conduct to be observed according to their precepts.

source: དེ་ནི་གཏི་མུག་ཆུང་ངུ་ཞེས་བྱའོ།
en: This then is lesser dullness

source: དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཕྱིར་བཟློག་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: “Bodhisattvas are skilled in reversing the mind.

source: དེ་དེ་ལྟར་སེམས་ལ་མཁས་པ་ལ། གང་འདོད་པ་རྣམས་ལ་དགའ་བ་དང་འདོད་པ་རྣམས་ལ་མོས་པ་དང་། འདོད་པ་རྣམས་ལ་ལྷག་པར་ཆགས་པ་དེ་ལྟ་བུ་མེད་པ་ཡིན་ཏེ།
en: As they are experts with respect to the mind, they do not take delight in pleasures, they do not wish for pleasures, and they are not attached to pleasures.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་སེམས་ལ་མཁས་པའི་ཕྱིར་རོ།
en: Why is that? Because they are experts on the mind.

source: འོན་ཏེ་ལུང་དུ་མ་བསྟན་པ་ལ་སྤྱོད་ན། དེ་ལ་དྲན་པ་དང་ལྡན་ཞིང་ནན་ཏན་དུ་བྱེད་ལ། དེ་བརྟག་པ་ལ་བརྩོན་པ་ཡིན་ཏེ།
en: Yet if they nevertheless engage in neutral acts they will apply mindfulness and exertion and apply themselves diligently based on analysis.

source: དེ་ལ་ཇི་ལྟར་ན་ལུང་དུ་མ་བསྟན་པ་ལ་སྤྱོད་པ་ཡིན་ཞེ་ན།
en: What is meant by engagement in neutral acts?

source: གང་གི་ཚེ་སེམས་ཕྱི་རོལ་ཏུའང་མི་རྒྱུ། ནང་དུའང་མི་རྒྱུ།
en: This occurs when the mind does not move either externally or internally,

source: དགེ་བ་ལའང་མི་སྤྱོད། མི་དགེ་བ་ལའང་མི་སྤྱོད།
en: when there is no engagement in positive or negative acts,

source: ལྷག་མཐོང་ལ་ཡང་མི་སྤྱོད། ཞི་གནས་ཀྱང་མི་འཛིན་ཅིང་
en: no practice of special insight, nor any observance of tranquility.

source: ཞུམ་ལ་གཉིད་ཀྱིས་ནོན་པར་གནས་པ་སྟེ།
en: Instead the mind remains dull and oppressed by torpor.

source: འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་ཉལ་ཉལ་བ་ལས་སད་པ་མིག་གཉིད་ཀྱིས་བསྒྲིབས་པའི་སེམས་མི་གསལ་བ་དེ་བཞིན་དུ་དེའི་ཚེ་སེམས་དེ་མི་གསལ་བར་འགྱུར་བ་སྟེ།
en: Such a mind is unclear, just as is the case, for example, with the obscured mind state of someone who has just been woken up from a deep sleep.

source: ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཡང་དག་པར་གཟེངས་བསྟོད་པ་དང་། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། ཡང་དག་པར་གཞག་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: Bodhisattvas are expert at uplifting the mind out of such states, at engendering joy, and at placing the mind.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ལ་མཁས་པ་ཡིན་ནོ།
en: Such is the expertise of bodhisattvas with regard to the mind.

source: དེ་དེ་ལྟར་སེམས་ལ་མཁས་པས་ཆོས་འདི་དག་ནི་སྒྱུ་མ་ལྟ་བུའོ། །ཆོས་འདི་དག་ནི་རྨི་ལམ་ལྟ་བུའོ། །ཆོས་འདི་དག་ནི་དགེ་བའོ། །ཆོས་འདི་དག་ནི་མི་དགེ་བའོ། །ཆོས་འདི་དག་ནི་འབྱུང་བའོ། །ཆོས་འདི་དག་ནི་མི་འབྱུང་བའོ་ཞེས་ཆོས་རྣམས་ལ་ཡོངས་སུ་རྟོག་སྟེ།
en: “With their expertise about the mind, bodhisattvas conceive of phenomena as illusion-like, dream-like, virtuous, unvirtuous, occurring, or non-occurring,

source: དེ་འདི་སྙམ་དུ་ཆོས་འདི་དག་ཐམས་ཅད་ནི་སེམས་ལ་གནས་པ། སེམས་ལས་བྱུང་བ། སེམས་སྔོན་དུ་འགྲོ་བ་སྟེ།
en: while doing so they consider how all these phenomena abide in the mind, arise from the mind, and are preceded by the mind.

source: སེམས་ཤིན་ཏུ་བཅིལ། ཤིན་ཏུ་བཏུལ། ཤིན་ཏུ་ཁོང་དུ་ཆུད་པར་བྱས་ན། ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་བཅིལ་བ་དང་། ཤིན་ཏུ་བཏུལ་བ་དང་། ཤིན་ཏུ་ཁོང་དུ་ཆུད་པར་འགྱུར་ཏེ། དེས་ཆོས་རྣམས་དེ་ལྟར་མཐོང་བས།
en: Thus, they see all these phenomena with the understanding that by purifying, disciplining, and comprehending the mind they will also purify, discipline, and comprehend phenomena.

source: དེ་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་སེམས་ཞི་བར་བྱ་བའི་ཕྱིར་ནན་ཏན་དུ་བྱེད་དེ།
en: By means of such causes, conditions, and bases, bodhisattvas exert themselves in pacifying the mind.

source: དེ་སེམས་ཉིད་ལ་སེམས་འདོགས་སོ།
en: In this way the mind corrects itself.

source: སེམས་ཉིད་ཀྱིས་སེམས་ཞི་བར་བྱེད་དོ།
en: The mind pacifies itself.

source: སེམས་ཉིད་ལ་སེམས་རབ་ཏུ་གཞོག་གོ།
en: The mind settles itself.

source: དེ་དེ་ལྟར་ཞི་བ་ལ་བརྩོན་པས་སེམས་རྩེ་གཅིག་ཏུ་འགྱུར་ཏེ། རྩེ་གཅིག་ཏུ་རེད་ནས་མཉམ་པར་གཞོག་གོ།
en: Persevering in this way in pacifying the mind, it becomes one-pointed, and with one-pointedness they accomplish equipoise.

source: སེམས་མཉམ་པར་བཞག་པ་ལ་དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་མངོན་དུ་འགྱུར་ཏེ།
en: Once the mind is in equipoise they experience the joy that arises from disengagement,

source: དེ་ཡིད་དགའ་བར་གྱུར་ནས་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ།
en: with such mental joy they separate from desire as well as from negative and unvirtuous qualities.

source: རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Thus, while involved in thought and discernment, they experience the joy and bliss that arise from disengagement, perfect the first concentration, and remain within it.

source: དེ་རྟོག་པ་དང་དཔྱོད་པ་མི་སྣང་བར་བྱ་བའི་ཕྱིར་ནན་ཏན་བྱེད་
en: “From there they endeavor to let thought and discernment disappear.

source: ཅིང་དགའ་བ་དང་། བདེ་བའི་རོ་དེའང་མྱང་བར་མི་བྱེད་དེ་མི་རྟོག་གོ་སྙམ་ནས་བསམ་གཏན་དང་པོ་ལས་སེམས་སྐྱེད་དོ། །
en: Hence, with a wish not to relish or conceive of joy and bliss they raise their minds above the first concentration.

source: དེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ཆགས་པ་མེད་པའི་ཡིད་དུ་གྱུར་པས་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་
en: Separating from thought and discernment their minds become detached and they attain an inner brightness that forms a single mental continuum.

source: ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Thus, based on absorption that is free of thought and discernment they complete the joyous and blissful second concentration and remain within it.

source: དེ་དགའ་བ་དང་སྡུག་བསྔལ་བ་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: “Comprehending that the second concentration is joyous but also suffering,

source: སྡུག་བསྔལ་ལོ་སྙམ་ནས་བཏང་སྙོམས་ལ་གནས་པ་ཡིན།
en: they think, ‘This is suffering,’ and so they rest in equanimity.

source: བཏང་སྙོམས་ལ་གནས་པས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: While resting in equanimity they are mindful, alert, and their bodies experience pleasure.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: About this state the noble ones have taught, ‘When one is mindful and blissful, that is equanimity.’

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: In this way they complete the third concentration free of joy, and remain within it.

source: དེ་བསམ་གཏན་གསུམ་པ་གཏོང་ངོ་སྙམ་ནས་བསམ་གཏན་བཞི་པ་ལ་སེམས་གཏོང་སྟེ།
en: “Then, intent on relinquishing the third concentration, they direct their minds toward the fourth.

source: དེས་བསམ་གཏན་བཞི་པ་ཐོབ་པས་བདག་ཏུ་འཛིན་པ་ཕྱིར་ལྡོག་གོ།
en: With the attainment of the fourth concentration they reverse the grasping at a self.

source: བདག་ཏུ་འཛིན་པ་ཕྱིར་ལྡོག་པས་བདེ་བ་ཡང་སྤོང་། སྡུག་བསྔལ་བ་ཡང་སྤོང་སྟེ།
en: As the grasping at a self is reversed, both pleasure and pain will have been relinquished as well.

source: དེ་བདེ་བ་ཡང་སྤངས། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན།
en: Having here relinquished pleasure, and having earlier already abandoned pain, mental pleasure and mental displeasure now fade away.

source: སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: In this way they complete and remain within the fourth concentration, which is neither pleasurable nor painful, but neutral and endowed with pure mindfulness.

source: དེ་བདག་གི་ལུས་དང་ནམ་མཁའི་ལུས་སུ་གཅིག་ཏུ་མོས་པར་བྱེད་དེ། དེ་དེ་ལྟར་མོས་པས་གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡང་དག་པར་འདས་པ་ཡིན།
en: “Next they focus on their own bodies being one with the body of space, and with that focus they entirely transcend all perceptions of form.

source: ཐོགས་པའི་འདུ་ཤེས་ཀྱང་ནུབ་པ་ཡིན་ཏེ། དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ།
en: As all perceptions of impediment fade away they go beyond all perception of form.

source: ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་
en: All perceptions of impediment fade away and no perception of diversity occurs either.

source: ནམ་མཁའ་མཐའ་ཡས་ས་སྙམ་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Thus, thinking, ‘This is infinite space,’ they perfect the sense source of infinite space and remain within it.

source: དེ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས།
en: Next, they go beyond the sense source of infinite space and instead conceive of infinite consciousness.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: In this way they perfect the sense source of infinite consciousness and remain within it.

source: དེ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས། ཅི་ཡང་མེད་དོ་སྙམ་ནས་
en: Then, transcending the sense source of infinite consciousness, they feel, ‘There is nothing whatsoever!’

source: ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: and with that perception they perfect the sense source of nothing whatsoever and remain within it.

source: དེ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: As they go beyond the sense source of nothing whatsoever, they perfect the sense source of neither presence nor absence of perception and remain within it.

source: དེའི་གོང་ན་གང་སེམས་ཀྱི་མཚན་མ་མེད་པ། རྒྱུ་བ་ཐམས་ཅད་འགགས་པ་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བ་འདི་ནི་འགོག་པ་ཞེས་བྱ་སྟེ།
en: “Above that there are no further marks of the mind and, as all mental movement ceases, this freedom from all obscuration is what is known as cessation.

source: དེ་ནི་ཤེས་པར་བྱའོ་སྙམ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྙོམས་པར་འཇུག་གི
en: Considering this as something they must know, bodhisattvas abide in equilibrium.

source: དེ་ལ་མངོན་པར་དགའ་བའི་རྟེན་གྱི་གནས་མི་སྐྱེད་དོ།
en: “However, they do not see these levels as eternal and delightful abodes.

source: དེ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་ཆེན་པོར་གྱུར་པ་ཚད་མེད་པ། མི་གཉིས་པ་ཤིན་ཏུ་བསྒོམས་པས་
en: Instead they train intensively in a mind of love that is free of resentment, rivalry, and harm, and is expansive, immeasurable, and nondual.

source: ཕྱོགས་གཅིག་ཏུ་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: When this single-minded inspiration pervades them, they complete the respective level and remain within it.

source: གཅིག་ཏུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཉིས་པ་དང་། དེ་བཞིན་དུ་གསུམ་པ་དང་། དེ་བཞིན་དུ་བཞི་པ་དང་།
en: This applies to the first, second, third, and fourth concentration levels,

source: བླ་དང་། འོག་དང་། གྲྭའི་འཇིག་རྟེན་
en: as well as the worlds above, below, and around.

source: འདི་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཐམས་ཅད་དུ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་ཆེན་པོར་གྱུར་པ། ཚད་མེད་པ། མི་གཉིས་པ། ཤིན་ཏུ་བསྒོམས་པས་
en: Throughout them all they train intensively in a mind of love that is free of resentment, rivalry, and harm, and is expansive, immeasurable, and nondual.

source: མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: When this inspiration pervades them, they complete the respective level and remain within it.

source: དེ་བཞིན་དུ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་
en: “The same goes for compassion, joy, and equanimity.

source: ཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་ཆེན་པོར་གྱུར་པ། ཚད་མེད་པ། མི་གཉིས་པ། ཤིན་ཏུ་བསྒོམས་པས་
en: These qualities are also trained in by means of a mind that is free of resentment, rivalry, and harm, and is expansive, immeasurable, and nondual.

source: འདི་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཐམས་ཅད་དུ་བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་ཆེན་པོར་གྱུར་པ། ཚད་མེད་པ། མི་གཉིས་པ་ཤིན་ཏུ་བསྒོམས་པས་
en: Throughout them all they train intensively in a mind of equanimity that is free of resentment, rivalry, and harm, and is expansive, immeasurable, and nondual.

source: དེ་མངོན་པར་ཤེས་པ་ལྔ་སྐྱེད་དོ། །དེ་ལ་ཡང་མ་ཞེན་པ་ཡིན་ཏེ།
en: This gives rise to the five superknowledges, yet there is no attachment to them,

source: གོང་དུ་ཡང་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཆོས་རྣམས་ཡོངས་སུ་ཚོལ་ལོ།
en: and thus bodhisattvas continue the pursuit of the qualities that complete the accumulations for awakening.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ practice of excellent concentration.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent insight possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་མེད་པ་ལ་མཁས་པ་རྣམས་ཡིན། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མཁས་པ་རྣམས་ཡིན། འདུས་བྱས་ལ་མཁས་པ་རྣམས་ཡིན། འཁོར་བའི་རྒྱུན་ལ་མཁས་པ་རྣམས་ཡིན། འཁོར་བའི་ལྡོག་པ་ལ་མཁས་པ་རྣམས་ཡིན། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མཁས་པ་རྣམས་ཡིན། ཐེག་པ་ཆེན་པོ་ལ་མཁས་པ་རྣམས་ཡིན། བདུད་ཀྱི་ལས་ཡོངས་སུ་སྤངས་པ་ལ་མཁས་པ་རྣམས་ཡིན། མ་ལོག་པའི་ཤེས་རབ་ཅན་རྣམས་ཡིན་མཉམ་པ་མེད་པའི་ཤེས་རབ་ཅན་རྣམས་ཡིན་ནོ།
en: What are those ten? They are expertise concerning the absence of self, expertise concerning the ripening of karma, expertise concerning the conditioned, expertise concerning the continuity of cyclic existence, expertise concerning the dissolving of cyclic existence, expertise concerning the vehicles of the hearers and solitary buddhas, expertise concerning the Great Vehicle, expertise in giving up the activities of the māras, unmistaken insight, and unequaled insight.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདག་མེད་པ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ expertise concerning the absence of self.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་གཟུགས་ལ་རྟོག
en: Noble son, bodhisattvas reflect on form by means of authentic insight.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་རྟོག་སྟེ།
en: Likewise, they concern themselves with feeling, perception, formation, and consciousness.

source: དེ་གཟུགས་ལ་རྟོག་པ་ན་གཟུགས་ཀྱི་སྐྱེ་བ་མི་དམིགས། ཀུན་འབྱུང་བ་མི་དམིགས། འགོག་པ་མི་དམིགས་སོ།
en: As they concern themselves with form they do not observe any arising, origin, or cessation of form.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་མི་དམིགས། ཀུན་འབྱུང་བ་མི་དམིགས། འགོག་པ་མི་དམིགས་སོ།
en: Likewise, neither do they observe any arising, origin, or cessation of feeling, perception, formation, or consciousness.

source: དེ་ཡང་དོན་དམ་པར་ཡིན་གྱི་ཐ་སྙད་ཀྱི་རང་བཞིན་དུ་མ་ཡིན་ཏེ།
en: This, moreover, is in terms of the ultimate and not in terms of the conventional nature of things.

source: དེས་དོན་དམ་པའི་རང་བཞིན་གང་ཡིན་པ་དང་། ཐ་སྙད་ཀྱི་རང་བཞིན་གང་ཡིན་པའི་རང་བཞིན་དེ་གཉིས་ཀ་ཡང་བརྗོད་པའི་རང་བཞིན་དུ་མི་དམིགས་ཏེ།
en: Thus, neither the nature of the ultimate nor the nature of the conventional are observed as being of an expressible nature.

source: དེའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་དེ།
en: Hence, they persevere with unswerving diligence.

source: མགོའི་ཐོད་ལ་མེ་འབར་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་རྩོལ་ཞིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: With a diligence as if their hair had caught fire, they strive and persist for the benefit of sentient beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདག་མེད་པ་ལ་མཁས་པ་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ expertise concerning the absence of self.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise concerning the ripening of karma consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་དཔྱོད་དེ།
en: Bodhisattvas think like this:

source: འཇིག་རྟེན་གནས་པ་འདི་ནི་གར་མཁན་གྱི་ཚོན་དང་འདྲ་བ། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་རང་བཞིན་གྱིས་སྟོང་ལ།
en: ‘This worldly life is devoid of intrinsic nature and is just like a dancer’s mask or a city of gandharvas.

source: སེམས་ཅན་འདི་དག་ཀྱང་སེམས་ཅན་མ་ཡིན་ན་
en: These sentient beings are also not sentient beings,

source: འོན་ཀྱང་བདག་ཏུ་འཛིན་པ་ལ་མངོན་པར་ཞེན་པས་དེ་དག་དེའི་ཕྱིར་ལམ་ཁོང་དུ་ཆུད་པ་མི་འཐོབ་བོ། །
en: yet because of their attachment to grasping at a self they do not gain any comprehension of the path.

source: དེ་དག་ནི་འདི་སྙམ་དུ་གལ་ཏེ་བདག་གམ། སེམས་ཅན་ནམ། སྲོག་གམ། སྐྱེ་བ་པོའམ། གསོ་བའམ། སྐྱེས་བུའམ། གང་ཟག་གམ། ཤེད་ལས་སྐྱེས་སམ། ཤེད་བུ་མེད་ན་དགེ་བ་དང་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་མེད་པར་འགྱུར་རོ་
en: They believe that there could not be any ripening of virtuous and unvirtuous karmic actions unless there exists a self, a being, a life-force, a creature, a soul, an individual, a person, or a human being.
